print("=============================================")
print("Лабораторна робота №1")
print("Програмування лінійних алгоритмів")
print("Автор: Романов Микола, КМ-91 (18 варіант)")
print("=============================================")
print("Знайти суму членів арифметичної прогресії, якщо відомі її перший член,")
print("знаменник і число членів прогресії.")
print("=============================================")
while True:
    while True:
        try:
            a1 = int(input("Введіть перший член арифметичної прогресії - "))
            break
        except ValueError:
            print("Введіть число")
    while True:
        try:
            d = int(input("Введіть значення знаменника - "))
            break
        except ValueError:
            print("Введіть число")
    while True:
        try:
            n = int(input("Введіть кількість членів прогресії - "))
            break
        except ValueError:
            print("Введіть число")
    an = a1+d*(n-1)
    S = (a1+an)/2*n
    print("Сума членів арифметичної прогресії дорівнює - ", S)
    print("=============================================")