print("=============================================")
print("Лабораторна робота №1")
print("Програмування лінійних алгоритмів")
print("Автор: Романов Микола, КМ-91 (18 варіант)")
print("=============================================")
print("Визначити, введений символ є буквою чи цифрою")
print("=============================================")
while True:
    user_input = input("Введіть один символ - ")
    if user_input.isdigit():
        print("Ви ввели цифру")
    else:
        print("Ви ввели букву")
    print("=============================================")