from math import sin
print("=============================================")
print("Лабораторна робота №1")
print("Програмування лінійних алгоритмів")
print("Автор: Романов Микола, КМ-91 (18 варіант)")
print("=============================================")
print("Обчислити функцію")
print("=============================================")
while True:
    while True:
        try:
            x = float(input("Введіть значення X - "))
            break
        except ValueError:
            print("Введіть число")
    if x <= 3:
        y = float(pow(x,2)+3*x+9)
    if x > 3:
        y = float((sin(x))/(pow(x,2)-9))
    print("Значення функції дорівнює - ", y)
    print("=============================================")